<?php
use think\Env;

return array (
    //用户组配置
	'user_group' => [
		0 => '游客',
		1 => '会员',
		2 => '管理员',
	],
    //mqtt配置
    'mqtt' => [
        'host' => Env::get('mqtt.host','192.168.1.247'),
        'port'=>'1883',
        'qos' => 1,
        'useSSL' => false
    ],
    //聊天室房间设置
    'room_logPage' => 20, //每页页数
    'room_chatTime' => strtotime(date('Ymd'))-3600*24*14,
    //单点登录相关参数
    'sso_pre' => 'https://mc.royaleu.me',
    'vip_sso'=>[
        'deskey'   =>'rochatmm',
        'platform' =>'chatroom',
        'signkey'  =>'0fcb4bcd0901a423f8d9afe3d1a84afb',
    ],

    'pk10' => [
        'T' => '皇家彩世界聊天室-北京赛车开奖现场,pk10视频直播',
        'K' => '北京赛车聊天室、PK10聊天室、PK10开奖聊天室',
        'D' => '皇家彩世界聊天室平台,是一款方便、简洁的PK10开奖直播聊天室,火爆现场,北京赛车聊天室拥有多人同时在线畅聊开奖结果及技巧交流。'
    ],
                                     
    'xyft' => [
        "T" => "皇家彩世界聊天室-幸运飞艇开奖现场,幸运飞艇视频直播",
        "K" => "幸运飞艇聊天室、幸运飞艇开奖聊天平台",
        "D" => "皇家彩世界聊天室平台,是一款方便、简洁的幸运飞艇开奖直播聊天室,火爆现场,幸运飞艇聊天室拥有多人同时在线畅聊开奖结果。"
    ],                           
                                        
    'gdkl10' => [
        "T" => "皇家彩世界聊天室-广东快乐十分开奖现场,广东快乐十分视频直播",
        "K" => "广东快乐十分聊天室、广东快乐十分开奖聊天平台",
        "D" => "皇家彩世界聊天室平台,是一款方便、简洁的广东快乐十分开奖直播聊天室,火爆现场,广东快乐十分聊天室拥有多人同时在线畅聊开奖结果及技巧交流。"   
    ],                               
                                        
    'cqssc' => [
        "T" => "皇家彩世界聊天室-重庆时时彩开奖现场,重庆时时彩视频直播",
        "K" => "重庆时时彩聊天室、重庆时时彩聊天平台",
        "D" => "皇家彩世界聊天室平台,是一款方便、简洁的重庆时时彩开奖直播聊天室,火爆现场,重庆时时彩聊天室拥有多人同时在线畅聊开奖结果及技巧交流。"
    ],                                 

);